/**
 * @fileOverview 通用正则
 */

const RegxRule = {
    username: /^(?!(cn|CN))[a-z0-9_-]*$/i,                      //用户名不能以CN|cn开头
    password: /^(?=.*[0-9].*)(?=.*[A-Z].*)[0-9a-zA-Z]{8,20}$/,  // 密码 -> 密码必须是数字和英文字母组合,必须有一个大写字母
    bankCard: /^(\d{16}|\d{19})$/, // 银行卡号
    trim: /(^\s+)|(\s+$)/g,   // 空格
    phone: /^1(3|4|5|7|8)\d{9}$/,                               // 手机号
    telPhone: /^0\d{2,3}-?\d{7,8}$/,                            //电话号码
    idCard: /(^[1-9]\d{5}(18|19|([23]\d))\d{2}((0[1-9])|(10|11|12))(([0-2][1-9])|10|20|30|31)\d{3}[0-9Xx]$)|(^[1-9]\d{5}\d{2}((0[1-9])|(10|11|12))(([0-2][1-9])|10|20|30|31)\d{2}$)/,  //身份证
    zipCode: /^[1-9]\d{5}$/,                                     //中国邮政编码
    referenceId: /^((CN)?[0-9]+)?$/i,                            //推荐人,安置人，不能为空
    referenceIdTrim: /^$|^((CN)?[0-9]+)?$/i,                     //推荐人,安置人，可以为空
};

export default RegxRule;
